local text_conf = {}



text_conf.club_help = { text = "\
俱乐部目的：\n\
1.方便代理进行成员招收和管理。\n\
2.可以让成员进行聊天互动。\n\
3.快速开房功能和房卡统计功能。\n\
俱乐部主要功能：\n\
1.俱乐部管理: 【成员管理】和【游戏管理】。\n\
2.成员互动: 【聊天大厅】和【数据统计】。\n\
3.代理管理: 【快速开房】和【房卡统计】。\n\
创建俱乐部：\n\
1.必须成为代理才有权限创建俱乐部。\n\
2.【老代理】必须联系客服申请权限，才能获得资格创建俱乐部。\n\
3.【新代理】必须联系客服申请权限，并购买一定数量的房卡，才能获得资格创建俱乐部。\n\
4.【代理】最多可以创建5个俱乐部。\n\
加入俱乐部：\n\
1.【所有人】都可以加入俱乐部。\n\
2.【玩家】最多可以加入10个俱乐部。\n\
俱乐部基础设置：\n\
1.会长可以修改俱乐部头像，俱乐部名字，俱乐部介绍，俱乐部公告。会员只允许查看。\n\
2.点击右上角下拉按钮，会长可以【解散俱乐部】，会员可以【退出俱乐部】。\n\
成员管理：\n\
1.会长可以邀请玩家进入俱乐部，在【申请列表】（仅会长可见）中进行审批。\n\
2.会长可以【踢出会员】。\n\
3.可以点击玩家头像可以查看该玩家的个人信息。\n\
4.点击【数据统计】分页按钮可以查看玩家的详细战绩数据统计。\n\
游戏管理：\n\
1.会长可以对3项【房间权限】（扣房卡，创房者，对局人员限制）进行管理。\n\
2.会长可以通过添加新玩法，对游戏规则权限进行管理。\n\
快速开房：\n\
1.需要会长设置好游戏玩法才能进行快速开房。\n\
2.根据不同的【玩法规则】，创建不同玩法的房间进行对局。\n\
3.根据不同的【房间权限】，会进行对应房间。\n\
房间列表：\n\
1.可以查看未开始和已结束房间情况。\n\
2.【扣卡者】可以解散未开始的房间。\n\
3.会员可以查看自己参与对局所在的已结束房间。\n\
4.已结束的房间会显示总战绩。\n\
房卡统计：\n\
1.会长可以查看房间信息。\n\
2.会长可以查看每局的【大赢家】。\n\
分享俱乐部：\n\
1.点击俱乐部大厅的【邀请加入】按钮，能够输入玩家ID，进行单对单邀请玩家直接进入俱乐部。\n\
2.点击俱乐部设置的【复制俱乐部信息】按钮，能够复制俱乐部相关信息进行粘贴分享。\n\
快速匹配：\n\
俱乐部内点击快速匹配，即可快速加入俱乐部内未开局人最多的房间，或者快速创建新房间 \n\
"

}



return text_conf